ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_sdio.cpp
/**
  ******************************************************************************
  * @file    stm32f10x_sdio.c
  * @author  MCD Application Team
  * @version V3.5.0
  * @date    11-March-2011
  * @brief   This file provides all the SDIO firmware functions.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_rcc.h"
#include "stm32f10x_sdio.h"
uint16_t SDIO::ObjectNum = 0;
/** @addtogroup STM32F10x_StdPeriph_Driver
  * @{
  */

/** @defgroup SDIO
  * @brief SDIO driver modules
  * @{
  */

/** @defgroup SDIO_Private_TypesDefinitions
  * @{
  */

/* ------------ SDIO registers bit address in the alias region ----------- */
#define SDIO_OFFSET                (SDIO_BASE - PERIPH_BASE)

/* --- CLKCR Register ---*/

/* Alias word address of CLKEN bit */
#define CLKCR_OFFSET              (SDIO_OFFSET + 0x04)
#define CLKEN_BitNumber           0x08
#define CLKCR_CLKEN_BB            (PERIPH_BB_BASE + (CLKCR_OFFSET * 32) + (CLKEN_BitNumber * 4))

/* --- CMD Register ---*/

/* Alias word address of SDIOSUSPEND bit */
#define CMD_OFFSET                (SDIO_OFFSET + 0x0C)
#define SDIOSUSPEND_BitNumber     0x0B
#define CMD_SDIOSUSPEND_BB        (PERIPH_BB_BASE + (CMD_OFFSET * 32) + (SDIOSUSPEND_BitNumber * 4))

/* Alias word address of ENCMDCOMPL bit */
#define ENCMDCOMPL_BitNumber      0x0C
#define CMD_ENCMDCOMPL_BB         (PERIPH_BB_BASE + (CMD_OFFSET * 32) + (ENCMDCOMPL_BitNumber * 4))

/* Alias word address of NIEN bit */
#define NIEN_BitNumber            0x0D
#define CMD_NIEN_BB               (PERIPH_BB_BASE + (CMD_OFFSET * 32) + (NIEN_BitNumber * 4))

/* Alias word address of ATACMD bit */
#define ATACMD_BitNumber          0x0E
#define CMD_ATACMD_BB             (PERIPH_BB_BASE + (CMD_OFFSET * 32) + (ATACMD_BitNumber * 4))

/* --- DCTRL Register ---*/

/* Alias word address of DMAEN bit */
#define DCTRL_OFFSET              (SDIO_OFFSET + 0x2C)
#define DMAEN_BitNumber           0x03
#define DCTRL_DMAEN_BB            (PERIPH_BB_BASE + (DCTRL_OFFSET * 32) + (DMAEN_BitNumber * 4))

/* Alias word address of RWSTART bit */
#define RWSTART_BitNumber         0x08
#define DCTRL_RWSTART_BB          (PERIPH_BB_BASE + (DCTRL_OFFSET * 32) + (RWSTART_BitNumber * 4))

/* Alias word address of RWSTOP bit */
#define RWSTOP_BitNumber          0x09
#define DCTRL_RWSTOP_BB           (PERIPH_BB_BASE + (DCTRL_OFFSET * 32) + (RWSTOP_BitNumber * 4))

/* Alias word address of RWMOD bit */
#define RWMOD_BitNumber           0x0A
#define DCTRL_RWMOD_BB            (PERIPH_BB_BASE + (DCTRL_OFFSET * 32) + (RWMOD_BitNumber * 4))

/* Alias word address of SDIOEN bit */
#define SDIOEN_BitNumber          0x0B
#define DCTRL_SDIOEN_BB           (PERIPH_BB_BASE + (DCTRL_OFFSET * 32) + (SDIOEN_BitNumber * 4))

/* ---------------------- SDIO registers bit mask ------------------------ */

/* --- CLKCR Register ---*/

/* CLKCR register clear mask */
#define CLKCR_CLEAR_MASK         ((uint32_t)0xFFFF8100)

/* --- PWRCTRL Register ---*/

/* SDIO PWRCTRL Mask */
#define PWR_PWRCTRL_MASK         ((uint32_t)0xFFFFFFFC)

/* --- DCTRL Register ---*/

/* SDIO DCTRL Clear Mask */
#define DCTRL_CLEAR_MASK         ((uint32_t)0xFFFFFF08)

/* --- CMD Register ---*/

/* CMD Register clear mask */
#define CMD_CLEAR_MASK           ((uint32_t)0xFFFFF800)

/* SDIO RESP Registers Address */
#define SDIO_RESP_ADDR           ((uint32_t)(SDIO_BASE + 0x14))

/**
  * @}
  */

/** @defgroup SDIO_Private_Defines
  * @{
  */

/**
  * @}
  */

/** @defgroup SDIO_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @defgroup SDIO_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup SDIO_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

SDIO::SDIO(InitTypeDef& InitStruct)
{
	ObjectNum++;
	this->Init(InitStruct);
	this->On();
}

SDIO::SDIO(uint32_t ClockEdge, uint32_t ClockBypass, uint32_t ClockPowerSave, uint32_t BusWide, uint32_t HardwareFlowControl, uint8_t ClockDiv)
{
	SDIO::InitTypeDef aaa;
	ObjectNum++;
	aaa.ClockEdge = ClockEdge;
	aaa.ClockBypass = ClockBypass;
	aaa.ClockPowerSave = ClockPowerSave;
	aaa.BusWide = BusWide;
	aaa.HardwareFlowControl = HardwareFlowControl;
	aaa.ClockDiv = ClockDiv;
	this->Init(aaa);
	this->On();
}

SDIO_TypeDef* SDIO::GetPeriphPointer(void)
{
	return _SDIO;
}

void SDIO::On()
{
	this->ClockCmd(ENABLE);
}

void SDIO::Off()
{
	this->ClockCmd(DISABLE);
}

SDIO& SDIO::operator<<(uint32_t Data)
{
	this->WriteData(Data);
	return *this;
}

SDIO& SDIO::operator>>(uint32_t& Data)
{
	Data = this->ReadData();
	return *this;
}

/** @defgroup SDIO_Private_Functions
  * @{
  */
SDIO::~SDIO()
{
	if(--ObjectNum==0)
	{
		this->Off();
		RCC::ClockCmd(*this,DISABLE);
	}
}
/**
  * @brief  Deinitializes the SDIO peripheral registers to their default reset values.
  * @param  None
  * @retval None
  */
void SDIO::DeInit(void)
{
	_SDIO->POWER = 0x00000000;
	_SDIO->CLKCR = 0x00000000;
	_SDIO->ARG = 0x00000000;
	_SDIO->CMD = 0x00000000;
	_SDIO->DTIMER = 0x00000000;
	_SDIO->DLEN = 0x00000000;
	_SDIO->DCTRL = 0x00000000;
	_SDIO->ICR = 0x00C007FF;
	_SDIO->MASK = 0x00000000;
}

/**
  * @brief  Initializes the SDIO peripheral according to the specified
  *         parameters in the SDIO_InitStruct.
  * @param  SDIO_InitStruct : pointer to a SDIO_InitTypeDef structure
  *         that contains the configuration information for the SDIO peripheral.
  * @retval None
  */
void SDIO::Init(InitTypeDef &InitStruct)
{
	uint32_t tmpreg = 0;

	/* Check the parameters */
	assert_param(IS_SDIO_CLOCK_EDGE(InitStruct.ClockEdge));
	assert_param(IS_SDIO_CLOCK_BYPASS(InitStruct.ClockBypass));
	assert_param(IS_SDIO_CLOCK_POWER_SAVE(InitStruct.ClockPowerSave));
	assert_param(IS_SDIO_BUS_WIDE(InitStruct.BusWide));
	assert_param(IS_SDIO_HARDWARE_FLOW_CONTROL(InitStruct.HardwareFlowControl));
	RCC::ClockCmd(*this,ENABLE);
	/*---------------------------- SDIO CLKCR Configuration ------------------------*/
	/* Get the SDIO CLKCR value */
	tmpreg = _SDIO->CLKCR;

	/* Clear CLKDIV, PWRSAV, BYPASS, WIDBUS, NEGEDGE, HWFC_EN bits */
	tmpreg &= CLKCR_CLEAR_MASK;

