ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_sdio.cpp
	/* Set CLKDIV bits according to ClockDiv value */
	/* Set PWRSAV bit according to ClockPowerSave value */
	/* Set BYPASS bit according to ClockBypass value */
	/* Set WIDBUS bits according to BusWide value */
	/* Set NEGEDGE bits according to ClockEdge value */
	/* Set HWFC_EN bits according to HardwareFlowControl value */
	tmpreg |= (InitStruct.ClockDiv  | InitStruct.ClockPowerSave |
	           InitStruct.ClockBypass | InitStruct.BusWide |
	           InitStruct.ClockEdge | InitStruct.HardwareFlowControl);

	/* Write to SDIO CLKCR */
	_SDIO->CLKCR = tmpreg;
}

/**
  * @brief  Fills each SDIO_InitStruct member with its default value.
  * @param  SDIO_InitStruct: pointer to an SDIO_InitTypeDef structure which
  *   will be initialized.
  * @retval None
  */
void SDIO::StructInit(InitTypeDef &InitStruct)
{
	/* SDIO_InitStruct members default value */
	InitStruct.ClockDiv = 0x00;
	InitStruct.ClockEdge = SDIO_ClockEdge_Rising;
	InitStruct.ClockBypass = SDIO_ClockBypass_Disable;
	InitStruct.ClockPowerSave = SDIO_ClockPowerSave_Disable;
	InitStruct.BusWide = SDIO_BusWide_1b;
	InitStruct.HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
}

/**
  * @brief  Enables or disables the SDIO Clock.
  * @param  NewState: new state of the SDIO Clock. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::ClockCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *) CLKCR_CLKEN_BB = (uint32_t)NewState;
}

/**
  * @brief  Sets the power status of the controller.
  * @param  SDIO_PowerState: new state of the Power state.
  *   This parameter can be one of the following values:
  *     @arg SDIO_PowerState_OFF
  *     @arg SDIO_PowerState_ON
  * @retval None
  */
void SDIO::SetPowerState(uint32_t SDIO_PowerState)
{
	/* Check the parameters */
	assert_param(IS_SDIO_POWER_STATE(SDIO_PowerState));

	_SDIO->POWER &= PWR_PWRCTRL_MASK;
	_SDIO->POWER |= SDIO_PowerState;
}

/**
  * @brief  Gets the power status of the controller.
  * @param  None
  * @retval Power status of the controller. The returned value can
  *   be one of the following:
  * - 0x00: Power OFF
  * - 0x02: Power UP
  * - 0x03: Power ON
  */
uint32_t SDIO::GetPowerState(void)
{
	return (_SDIO->POWER & (~PWR_PWRCTRL_MASK));
}

/**
  * @brief  Enables or disables the SDIO interrupts.
  * @param  SDIO_IT: specifies the SDIO interrupt sources to be enabled or disabled.
  *   This parameter can be one or a combination of the following values:
  *     @arg SDIO_IT_CCRCFAIL: Command response received (CRC check failed) interrupt
  *     @arg SDIO_IT_DCRCFAIL: Data block sent/received (CRC check failed) interrupt
  *     @arg SDIO_IT_CTIMEOUT: Command response timeout interrupt
  *     @arg SDIO_IT_DTIMEOUT: Data timeout interrupt
  *     @arg SDIO_IT_TXUNDERR: Transmit FIFO underrun error interrupt
  *     @arg SDIO_IT_RXOVERR:  Received FIFO overrun error interrupt
  *     @arg SDIO_IT_CMDREND:  Command response received (CRC check passed) interrupt
  *     @arg SDIO_IT_CMDSENT:  Command sent (no response required) interrupt
  *     @arg SDIO_IT_DATAEND:  Data end (data counter, SDIDCOUNT, is zero) interrupt
  *     @arg SDIO_IT_STBITERR: Start bit not detected on all data signals in wide
  *                            bus mode interrupt
  *     @arg SDIO_IT_DBCKEND:  Data block sent/received (CRC check passed) interrupt
  *     @arg SDIO_IT_CMDACT:   Command transfer in progress interrupt
  *     @arg SDIO_IT_TXACT:    Data transmit in progress interrupt
  *     @arg SDIO_IT_RXACT:    Data receive in progress interrupt
  *     @arg SDIO_IT_TXFIFOHE: Transmit FIFO Half Empty interrupt
  *     @arg SDIO_IT_RXFIFOHF: Receive FIFO Half Full interrupt
  *     @arg SDIO_IT_TXFIFOF:  Transmit FIFO full interrupt
  *     @arg SDIO_IT_RXFIFOF:  Receive FIFO full interrupt
  *     @arg SDIO_IT_TXFIFOE:  Transmit FIFO empty interrupt
  *     @arg SDIO_IT_RXFIFOE:  Receive FIFO empty interrupt
  *     @arg SDIO_IT_TXDAVL:   Data available in transmit FIFO interrupt
  *     @arg SDIO_IT_RXDAVL:   Data available in receive FIFO interrupt
  *     @arg SDIO_IT_SDIOIT:   SD I/O interrupt received interrupt
  *     @arg SDIO_IT_CEATAEND: CE-ATA command completion signal received for CMD61 interrupt
  * @param  NewState: new state of the specified SDIO interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::ITConfig(uint32_t SDIO_IT, FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_SDIO_IT(SDIO_IT));
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	if(NewState != DISABLE)
	{
		/* Enable the SDIO interrupts */
		_SDIO->MASK |= SDIO_IT;
	}
	else
	{
		/* Disable the SDIO interrupts */
		_SDIO->MASK &= ~SDIO_IT;
	}
}

/**
  * @brief  Enables or disables the SDIO DMA request.
  * @param  NewState: new state of the selected SDIO DMA request.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::DMACmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *) DCTRL_DMAEN_BB = (uint32_t)NewState;
}

/**
  * @brief  Initializes the SDIO Command according to the specified
  *         parameters in the SDIO_CmdInitStruct and send the command.
  * @param  SDIO_CmdInitStruct : pointer to a SDIO_CmdInitTypeDef
  *         structure that contains the configuration information for the SDIO command.
  * @retval None
  */
void SDIO::SendCommand(CmdInitTypeDef &CmdInitStruct)
{
	uint32_t tmpreg = 0;

	/* Check the parameters */
	assert_param(IS_SDIO_CMD_INDEX(CmdInitStruct.CmdIndex));
	assert_param(IS_SDIO_RESPONSE(CmdInitStruct.Response));
	assert_param(IS_SDIO_WAIT(CmdInitStruct.Wait));
	assert_param(IS_SDIO_CPSM(CmdInitStruct.CPSM));

	/*---------------------------- SDIO ARG Configuration ------------------------*/
	/* Set the SDIO Argument value */
	_SDIO->ARG = CmdInitStruct.Argument;

	/*---------------------------- SDIO CMD Configuration ------------------------*/
	/* Get the SDIO CMD value */
	tmpreg = _SDIO->CMD;
	/* Clear CMDINDEX, WAITRESP, WAITINT, WAITPEND, CPSMEN bits */
	tmpreg &= CMD_CLEAR_MASK;
	/* Set CMDINDEX bits according to CmdIndex value */
	/* Set WAITRESP bits according to Response value */
	/* Set WAITINT and WAITPEND bits according to Wait value */
	/* Set CPSMEN bits according to CPSM value */
	tmpreg |= (uint32_t)CmdInitStruct.CmdIndex | CmdInitStruct.Response
	          | CmdInitStruct.Wait | CmdInitStruct.CPSM;

