ZZH-Finzlize/STM32F10x-Standard-Peripheral-Library-CPP-Ver1.9/src/stm32f10x_sdio.cpp
	/* Write to SDIO CMD */
	_SDIO->CMD = tmpreg;
}

/**
  * @brief  Fills each SDIO_CmdInitStruct member with its default value.
  * @param  SDIO_CmdInitStruct: pointer to an SDIO_CmdInitTypeDef
  *         structure which will be initialized.
  * @retval None
  */
void SDIO::StructInit(CmdInitTypeDef &CmdInitStruct)
{
	/* SDIO_CmdInitStruct members default value */
	CmdInitStruct.Argument = 0x00;
	CmdInitStruct.CmdIndex = 0x00;
	CmdInitStruct.Response = SDIO_Response_No;
	CmdInitStruct.Wait = SDIO_Wait_No;
	CmdInitStruct.CPSM = SDIO_CPSM_Disable;
}

/**
  * @brief  Returns command index of last command for which response received.
  * @param  None
  * @retval Returns the command index of the last command response received.
  */
uint8_t SDIO::GetCommandResponse(void)
{
	return (uint8_t)(_SDIO->RESPCMD);
}

/**
  * @brief  Returns response received from the card for the last command.
  * @param  SDIO_RESP: Specifies the SDIO response register.
  *   This parameter can be one of the following values:
  *     @arg SDIO_RESP1: Response Register 1
  *     @arg SDIO_RESP2: Response Register 2
  *     @arg SDIO_RESP3: Response Register 3
  *     @arg SDIO_RESP4: Response Register 4
  * @retval The Corresponding response register value.
  */
uint32_t SDIO::GetResponse(uint32_t SDIO_RESP)
{
	__IO uint32_t tmp = 0;

	/* Check the parameters */
	assert_param(IS_SDIO_RESP(SDIO_RESP));

	tmp = SDIO_RESP_ADDR + SDIO_RESP;

	return (*(__IO uint32_t *) tmp);
}

/**
  * @brief  Initializes the SDIO data path according to the specified
  *   parameters in the SDIO_DataInitStruct.
  * @param  SDIO_DataInitStruct : pointer to a SDIO_DataInitTypeDef structure that
  *   contains the configuration information for the SDIO command.
  * @retval None
  */
void SDIO::DataConfig(DataInitTypeDef &DataInitStruct)
{
	uint32_t tmpreg = 0;

	/* Check the parameters */
	assert_param(IS_SDIO_DATA_LENGTH(DataInitStruct.DataLength));
	assert_param(IS_SDIO_BLOCK_SIZE(DataInitStruct.DataBlockSize));
	assert_param(IS_SDIO_TRANSFER_DIR(DataInitStruct.TransferDir));
	assert_param(IS_SDIO_TRANSFER_MODE(DataInitStruct.TransferMode));
	assert_param(IS_SDIO_DPSM(DataInitStruct.DPSM));

	/*---------------------------- SDIO DTIMER Configuration ---------------------*/
	/* Set the SDIO Data TimeOut value */
	_SDIO->DTIMER = DataInitStruct.DataTimeOut;

	/*---------------------------- SDIO DLEN Configuration -----------------------*/
	/* Set the SDIO DataLength value */
	_SDIO->DLEN = DataInitStruct.DataLength;

	/*---------------------------- SDIO DCTRL Configuration ----------------------*/
	/* Get the SDIO DCTRL value */
	tmpreg = _SDIO->DCTRL;
	/* Clear DEN, DTMODE, DTDIR and DBCKSIZE bits */
	tmpreg &= DCTRL_CLEAR_MASK;
	/* Set DEN bit according to DPSM value */
	/* Set DTMODE bit according to TransferMode value */
	/* Set DTDIR bit according to TransferDir value */
	/* Set DBCKSIZE bits according to DataBlockSize value */
	tmpreg |= (uint32_t)DataInitStruct.DataBlockSize | DataInitStruct.TransferDir
	          | DataInitStruct.TransferMode | DataInitStruct.DPSM;

	/* Write to SDIO DCTRL */
	_SDIO->DCTRL = tmpreg;
}

/**
  * @brief  Fills each SDIO_DataInitStruct member with its default value.
  * @param  SDIO_DataInitStruct: pointer to an SDIO_DataInitTypeDef structure which
  *         will be initialized.
  * @retval None
  */
void SDIO::StructInit(DataInitTypeDef &DataInitStruct)
{
	/* SDIO_DataInitStruct members default value */
	DataInitStruct.DataTimeOut = 0xFFFFFFFF;
	DataInitStruct.DataLength = 0x00;
	DataInitStruct.DataBlockSize = SDIO_DataBlockSize_1b;
	DataInitStruct.TransferDir = SDIO_TransferDir_ToCard;
	DataInitStruct.TransferMode = SDIO_TransferMode_Block;
	DataInitStruct.DPSM = SDIO_DPSM_Disable;
}

/**
  * @brief  Returns number of remaining data bytes to be transferred.
  * @param  None
  * @retval Number of remaining data bytes to be transferred
  */
uint32_t SDIO::GetDataCounter(void)
{
	return _SDIO->DCOUNT;
}

/**
  * @brief  Read one data word from Rx FIFO.
  * @param  None
  * @retval Data received
  */
uint32_t SDIO::ReadData(void)
{
	return _SDIO->FIFO;
}

/**
  * @brief  Write one data word to Tx FIFO.
  * @param  Data: 32-bit data word to write.
  * @retval None
  */
void SDIO::WriteData(uint32_t Data)
{
	_SDIO->FIFO = Data;
}

/**
  * @brief  Returns the number of words left to be written to or read from FIFO.
  * @param  None
  * @retval Remaining number of words.
  */
uint32_t SDIO::GetFIFOCount(void)
{
	return _SDIO->FIFOCNT;
}

/**
  * @brief  Starts the SD I/O Read Wait operation.
  * @param  NewState: new state of the Start SDIO Read Wait operation.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::StartSDIOReadWait(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *) DCTRL_RWSTART_BB = (uint32_t) NewState;
}

/**
  * @brief  Stops the SD I/O Read Wait operation.
  * @param  NewState: new state of the Stop SDIO Read Wait operation.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::StopSDIOReadWait(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *) DCTRL_RWSTOP_BB = (uint32_t) NewState;
}

/**
  * @brief  Sets one of the two options of inserting read wait interval.
  * @param  SDIO_ReadWaitMode: SD I/O Read Wait operation mode.
  *   This parameter can be:
  *     @arg SDIO_ReadWaitMode_CLK: Read Wait control by stopping SDIOCLK
  *     @arg SDIO_ReadWaitMode_DATA2: Read Wait control using SDIO_DATA2
  * @retval None
  */
void SDIO::SetSDIOReadWaitMode(uint32_t SDIO_ReadWaitMode)
{
	/* Check the parameters */
	assert_param(IS_SDIO_READWAIT_MODE(SDIO_ReadWaitMode));

	*(__IO uint32_t *) DCTRL_RWMOD_BB = SDIO_ReadWaitMode;
}

/**
  * @brief  Enables or disables the SD I/O Mode Operation.
  * @param  NewState: new state of SDIO specific operation.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::SetSDIOOperation(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *) DCTRL_SDIOEN_BB = (uint32_t)NewState;
}

/**
  * @brief  Enables or disables the SD I/O Mode suspend command sending.
  * @param  NewState: new state of the SD I/O Mode suspend command.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::SendSDIOSuspendCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *) CMD_SDIOSUSPEND_BB = (uint32_t)NewState;
}

/**
  * @brief  Enables or disables the command completion signal.
  * @param  NewState: new state of command completion signal.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::CommandCompletionCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *) CMD_ENCMDCOMPL_BB = (uint32_t)NewState;
}

/**
  * @brief  Enables or disables the CE-ATA interrupt.
  * @param  NewState: new state of CE-ATA interrupt. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::CEATAITCmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

	*(__IO uint32_t *) CMD_NIEN_BB = (uint32_t)((~((uint32_t)NewState)) & ((uint32_t)0x1));
}

/**
  * @brief  Sends CE-ATA command (CMD61).
  * @param  NewState: new state of CE-ATA command. This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void SDIO::SendCEATACmd(FunctionalState NewState)
{
	/* Check the parameters */
	assert_param(IS_FUNCTIONAL_STATE(NewState));

